{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"name": "sequential_2", "layers": [{"config": {"input_length": 10, "name": "embedding_2", "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "activity_regularizer": null, "dtype": "float32", "output_dim": 50, "mask_zero": false, "trainable": true, "embeddings_regularizer": null, "batch_input_shape": [null, 10], "input_dim": 39203}, "class_name": "Embedding"}, {"config": {"kernel_size": [4], "bias_constraint": null, "kernel_regularizer": null, "name": "conv1d_2", "use_bias": true, "activation": "relu", "strides": [1], "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "trainable": true, "bias_regularizer": null, "filters": 128, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "global_max_pooling1d_2", "data_format": "channels_last"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "name": "dense_2", "use_bias": true, "units": 9, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "sigmoid"}, "class_name": "Activation"}]}, "class_name": "Sequential"}, "training_config": {"loss_weights": null, "loss": "binary_crossentropy", "metrics": ["top2_acc"], "sample_weight_mode": null, "optimizer_config": {"config": {"beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "decay": 0.0, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "amsgrad": false}, "class_name": "Adam"}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv1d_2/kernel", "shape": [4, 50, 128], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 9], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [9], "dtype": "float32"}, {"name": "embedding_2/embeddings", "shape": [39203, 50], "dtype": "float32"}]}]}