{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"layers": [{"config": {"batch_input_shape": [null, 10], "mask_zero": false, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "input_dim": 39203, "input_length": 10, "embeddings_regularizer": null, "trainable": true, "embeddings_constraint": null, "name": "embedding_3", "activity_regularizer": null, "output_dim": 50, "dtype": "float32"}, "class_name": "Embedding"}, {"config": {"strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [4], "padding": "valid", "filters": 128, "name": "conv1d_3", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "global_max_pooling1d_3", "data_format": "channels_last"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 9, "kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_3", "trainable": true}, "class_name": "Activation"}], "name": "sequential_3"}, "class_name": "Sequential"}, "training_config": {"optimizer_config": {"config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false, "decay": 0.0, "lr": 0.0010000000474974513}, "class_name": "Adam"}, "sample_weight_mode": null, "loss_weights": null, "loss": "binary_crossentropy", "metrics": ["top3_acc"]}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv1d_3/kernel", "shape": [4, 50, 128], "dtype": "float32"}, {"name": "conv1d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [128, 9], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [9], "dtype": "float32"}, {"name": "embedding_3/embeddings", "shape": [39203, 50], "dtype": "float32"}]}]}